# Функція all() є вбудованою функцією, яка повертає True, 
# якщо всі елементи в переданому їй об'єкті ітерації є істинними - 
# тобто не False, 0, "", None або будь-яке інше значення, 
# яке Python оцінює як хибне. Але будьте уважні, якщо об'єкт ітерації порожній, функція all() повертає True.

nums = [1, 2, 3, 4]
result = all(nums)  
print(result)
# Виведе True, оскільки всі числа в списку є істинними.


# Розглянемо більш складні приклади та перевіримо список на якусь умову.
# Чи всі елементи списку є парними?
nums = [1, 2, 3, 4]
is_all_even = all(x % 2 == 0 for x in nums) 
print(is_all_even)
# Виведе False, оскільки не всі числа в списку є парними.



# Чи всі слова у списку мають велику початкову букву?
words = ["Hello", "World", "Python"]
is_all_title_case = all(word.istitle() for word in words)
print(is_all_title_case)
# Виведе True, оскільки всі слова починаються з великої літери.