# Функція any() є вбудованою функцією, яка повертає True, якщо хоча б один елемент 
# із заданого об'єкта ітерації є істинним. 
# Якщо об'єкт ітерації порожній або всі його елементи є хибними, то any() повертає False.

# Перевіримо чи наявний хоч один елемент в списку який є істинним?
nums = [0, False, 5, 0]
result = any(nums)  
print(result)
# Виведе True, оскільки 5 є істинним значенням.


# В функцію можна передавати генератор або list comprehension. Наприклад перевіримо чи є в списку парні числа?
nums = [1, 3, 5, 7, 9]
result = any(x % 2 == 0 for x in nums)  
print(result)
# Виведе False, оскільки в списку немає парних чисел.