# В програмуванні досить часто необхідно створити заповнену колекцію. 
# Зробити це одним виразом не можна, доводиться писати цикл. 
# Наприклад, щоб створити список квадратів чисел від 1 до 5, треба написати наступний код:
sq = []
for i in range(1, 6):
    sq.append(i**2)

print(sq)

# Подібні операції, які ми робимо зі змінюваними колекціями списків list,
#  словників dict та множин set у циклі for. Для спрощення таких операцій в Python ввели конструкції Comprehensions .

# Але Python дозволяє зробити це більш елегантно, використовуючи спискові вирази (list comprehensions).
# Спискові вирази дозволяють створювати списки за допомогою простого і зрозумілого синтаксису.
# Синтаксис спискового виразу: