# лямбда-функції, відомі також як анонімні функції, які є важливою частиною Python 
# і використовуються для створення маленьких, однорядкових функцій.

# Синтаксис лямбда-функції є наступним:
# lambda arguments: expression

# Тут lambda — це ключове слово, що вказує на початок лямбда-функції. 
# arguments — це список аргументів, які приймає функція, 
# а expression — це вираз, який буде виконано та його результат повернуто.

add = lambda x, y: x + y
print(add(5, 3))  # Виведе 8

# Насправді це "поганий тон" зберігати лямбда-функції у змінних, 
# вони повинні створюватися там, де будуть використовуватися і більше ніде у коді не залишають слідів.
print((lambda x, y: x + y)(5, 3))  # Виведе 8


# Лямбда-функції часто використовуються як аргументи для функцій вищого порядку, 
# таких як map(), filter() або sorted(). Наприклад зворотне сортування списку для sorted():
nums = [1, 2, 3, 4, 5]
nums_sorted = sorted(nums, key=lambda x: -x)
print(nums_sorted)

